animal_tracker/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
    def index
        animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "sightings".* FROM "sightings" WHERE "sightings"."animal_id" = $1  [["animal_id", 1]]
---
    def show
        animal = Animal.find(params[:id])
        sightings = Sighting.where(animal_id: animal.id)

INSERT INTO "animals" ("common_name", "latin_name", "kingdom", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["common_name", "Bear"], ["latin_name", "Ursidae"], ["kingdom", "Mammalia"], ["created_at", "2020-08-06 20:46:42.499032"], ["updated_at", "2020-08-06 20:46:42.499032"]]
---
    def create
        animal = Animal.create(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 4]]
---
    def destroy
        animal = Animal.find(params[:id])
        if animal.destroy

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "animals" SET "kingdom" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["kingdom", "Arachnidas"], ["updated_at", "2020-08-06 00:00:20.661835"], ["id", 3]]
---
    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)