animal_tracker/app/controllers/sightings_controller.rb

    def index
        sightings = Sighting.where(date: params[:start_date]..params[:end_date])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."date" BETWEEN $1 AND $2  [["date", "2020-08-03 00:00:00"], ["date", "2020-08-06 00:00:00"]]

    def show
        sighting = Sighting.find(params[:id])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        sighting = Sighting.create(sighting_params)
---
INSERT INTO "sightings" ("date", "latitude", "longitude", "animal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2020-08-04 00:00:00"], ["latitude", "lat2"], ["longitude", "long2"], ["animal_id", 2], ["created_at", "2020-08-05 22:27:52.396403"], ["updated_at", "2020-08-05 22:27:52.396403"]]

    def destroy
        sighting = Sighting.find(params[:id])
        if sighting.destroy
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 2]]

    def update
        sighting = Sighting.find(params[:id])
        sighting.update(sighting_params)
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sightings" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "sightings"."id" = $4  [["latitude", "lat1"], ["longitude", "long1"], ["updated_at", "2020-08-06 00:02:16.857475"], ["id", 1]]